renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/sec_data/r_ble_sec_data.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2019-2022 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_ble_sec_data.c
 * Description  : Functions for BLE Security Data Management. 
 **********************************************************************************************************************/

/***********************************************************************************************************************
  Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
#include <string.h>
#include <stdlib.h>
#include "r_ble_sec_data.h"

#if (BLE_CFG_EN_SEC_DATA == 1) && (BLE_CFG_HCI_MODE_EN == 0)
#ifndef USE_EXTERNAL_CONTROLLER
#include "r_flash_rx_if.h"
#include "r_flash_rx_config.h"
#endif /* USE_EXTERNAL_CONTROLLER */

/***********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/
#define BLE_SECD_UPD_BN_ADD                                             (0x00)
#define BLE_SECD_UPD_BN_ADD_OVERWR                                      (0x01)
#define BLE_SECD_UPD_BN_DEL                                             (0x02)
#define BLE_SECD_UPD_BN_ALL_DEL                                         (0x03)
#define BLE_SECD_UPD_BN_UPD                                             (0x04)

/***********************************************************************************************************************
 Local Typedef definitions
 **********************************************************************************************************************/

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static st_ble_gap_key_ex_param_t gs_key_ex_param;
static st_ble_gap_key_dist_t gs_key_dist;

static const st_ble_dev_addr_t invalid_rem_addr = {
        .addr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
        .type = 0xFF
    };

static ble_status_t find_entry(st_ble_dev_addr_t * p_dev_addr, int32_t * p_entry, uint8_t * p_sec_data);
static void find_oldest_entry(int32_t * p_entry, uint8_t * p_sec_data);
static ble_status_t update_bond_num(int32_t entry, int32_t op_code, uint8_t * p_alloc_bond_num, uint8_t * p_sec_data);
static void update_bond_order(int32_t entry, uint8_t * p_sec_data, uint8_t bond_order);
static ble_status_t is_valid_entry(int32_t entry);
static ble_status_t read_bond_info(uint8_t * p_out_bond_num, uint8_t ** pp_sec_data, 
                                   st_ble_gap_bond_info_t * p_bond_info);
static void release_bond_info_buf(uint8_t * p_sec_data);

#ifdef USE_EXTERNAL_CONTROLLER
static uint8_t r_dflash_read(uint32_t addr, uint8_t *buff, uint16_t len);
static uint8_t r_dflash_write(uint32_t addr, uint8_t *buff, uint16_t len);
#else /* USE_EXTERNAL_CONTROLLER */
extern uint8_t r_dflash_read(uint32_t addr, uint8_t *buff, uint16_t len);
extern uint8_t r_dflash_write(uint32_t addr, uint8_t *buff, uint16_t len);
#endif /* USE_EXTERNAL_CONTROLLER */


/***********************************************************************************************************************
 Exported global functions
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_WriteLocInfo
 * Description  : Write Local device Identity Address, IRK and/or CSRK in DataFlash
 * Arguments    : st_ble_dev_addr_t * p_lc_id_addr            ; Local device Identity Address
 *              : uint8_t * p_lc_irk                          ; Local IRK
 *              : uint8_t * p_lc_csrk                         ; Local CSRK
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success 
 *                BLE_ERR_INVALID_PTR(0x0001)                 ; IRK(p_lc_id_addr or p_lc_irk) or CSRK(p_lc_csrk) 
 *                                                            ; is specified and as NULL. 
 *                BLE_ERR_INVALID_OPERATION(0x0009)           ; Write to DataFlash is failed.
 **********************************************************************************************************************/
ble_status_t R_BLE_SECD_WriteLocInfo(st_ble_dev_addr_t * p_lc_id_addr, uint8_t * p_lc_irk, uint8_t * p_lc_csrk)
{
    ble_status_t retval = BLE_SUCCESS;
    uint32_t local_tmp_data[(BLE_SECD_LOC_AREA_SIZE + BLE_SECD_MGN_DATA_SIZE + 3) / 4];

    if(((NULL == p_lc_id_addr) || (NULL == p_lc_irk)) && (NULL == p_lc_csrk))
    {
        return BLE_ERR_INVALID_PTR;
    }

    retval = r_dflash_read(BLE_SECD_BASE_ADDR, 
                           (uint8_t *)local_tmp_data, 
                           BLE_SECD_LOC_AREA_SIZE + BLE_SECD_MGN_DATA_SIZE);
    if(BLE_SUCCESS != retval)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

