renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/sec_data/r_ble_sec_data.c
    if(NULL != p_lc_irk)
    {
        memcpy((uint8_t *)local_tmp_data + BLE_SECD_MGN_DATA_SIZE, p_lc_irk, BLE_GAP_IRK_SIZE);
        memcpy((uint8_t *)local_tmp_data + BLE_SECD_MGN_DATA_SIZE + BLE_GAP_IRK_SIZE + BLE_GAP_CSRK_SIZE, 
               p_lc_id_addr,
               BLE_SECD_BD_ADDR_SIZE);
    }

    if(NULL != p_lc_csrk)
    {
        memcpy((uint8_t *)local_tmp_data + BLE_SECD_MGN_DATA_SIZE + BLE_GAP_IRK_SIZE, p_lc_csrk, BLE_GAP_CSRK_SIZE);
    }

    local_tmp_data[0] = BLE_SECD_MGC_NUM;

    retval = r_dflash_write(BLE_SECD_BASE_ADDR, 
                            (uint8_t *)local_tmp_data, 
                            BLE_SECD_LOC_AREA_SIZE + BLE_SECD_MGN_DATA_SIZE);
    if(BLE_SUCCESS != retval)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

    return retval;
} /* End of function R_BLE_SECD_WriteLocInfo() */

/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_ReadLocInfo
 * Description  : Read Local device Identity Address and IRK and/or CSRK in DataFlash.
 * Arguments    : st_ble_dev_addr_t * p_lc_id_addr            ; Local device Identity Address
 *              : uint8_t * p_lc_irk                          ; Local IRK
 *              : uint8_t * p_lc_csrk                         ; Local CSRK
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success 
 *                BLE_ERR_INVALID_PTR(0x0001)                 ; IRK(p_lc_id_addr or p_lc_irk) or CSRK(p_lc_csrk) 
 *                                                            ; is specified and as NULL. 
 *                BLE_ERR_INVALID_OPERATION(0x0009)           ; Read to DataFlash is failed.
 *                BLE_ERR_NOT_FOUND(0x000D)                   ; IRK and Identity Address not found.
 **********************************************************************************************************************/
ble_status_t R_BLE_SECD_ReadLocInfo(st_ble_dev_addr_t * p_lc_id_addr, uint8_t * p_lc_irk, uint8_t * p_lc_csrk)
{
    ble_status_t retval;
    uint8_t * p_loc_area;
    uint32_t mgc_num;

    if(((NULL == p_lc_id_addr) || (NULL == p_lc_irk)) && (NULL == p_lc_csrk))
    {
        return BLE_ERR_INVALID_PTR;
    }

    p_loc_area = malloc(BLE_SECD_MGN_DATA_SIZE + BLE_SECD_LOC_AREA_SIZE);
    if(NULL == p_loc_area)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }

    retval = r_dflash_read(BLE_SECD_ADDR_MGN_DATA, p_loc_area, BLE_SECD_MGN_DATA_SIZE + BLE_SECD_LOC_AREA_SIZE);
    if(BLE_SUCCESS != retval)
    {
        free(p_loc_area);
        return BLE_ERR_INVALID_OPERATION;
    }

    memcpy(&mgc_num, p_loc_area, BLE_SECD_MGC_NUM_SIZE);
    if(BLE_SECD_MGC_NUM != mgc_num)
    {
        free(p_loc_area);
        return BLE_ERR_NOT_FOUND;
    }

    if((NULL != p_lc_irk) && (NULL != p_lc_id_addr))
    {
        if(0xFF == p_loc_area[BLE_SECD_MGN_DATA_SIZE + BLE_GAP_IRK_SIZE + BLE_GAP_CSRK_SIZE + BLE_BD_ADDR_LEN])
        {
            /* invalid IRK and identity address */
            memset(p_lc_irk, 0x00, BLE_GAP_IRK_SIZE);
            memset(p_lc_id_addr, 0x00, BLE_SECD_BD_ADDR_SIZE);
        }
        else
        {
            /* valid IRK and identity address */
            memcpy(p_lc_irk, &p_loc_area[BLE_SECD_MGN_DATA_SIZE], BLE_GAP_IRK_SIZE);
            memcpy(p_lc_id_addr, &p_loc_area[BLE_SECD_MGN_DATA_SIZE + BLE_GAP_IRK_SIZE + BLE_GAP_CSRK_SIZE], 
                BLE_SECD_BD_ADDR_SIZE);
        }
    }

    if(NULL != p_lc_csrk)
    {
        uint8_t df_init[BLE_GAP_CSRK_SIZE];
        memset(df_init, 0xFF, BLE_GAP_CSRK_SIZE);
        if(0 == memcmp(df_init, &p_loc_area[BLE_SECD_MGN_DATA_SIZE + BLE_GAP_IRK_SIZE], BLE_GAP_CSRK_SIZE))
        {
            /* invalid CSRK */
            memset(p_lc_csrk, 0x00, BLE_GAP_CSRK_SIZE);
        }
        else
        {
            /* valid CSRK */
            memcpy(p_lc_csrk, &p_loc_area[BLE_SECD_MGN_DATA_SIZE + BLE_GAP_IRK_SIZE], BLE_GAP_CSRK_SIZE);
        }
    }

    free(p_loc_area);

    return BLE_SUCCESS;
} /* End of function R_BLE_SECD_ReadLocInfo() */

/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_DelLocInfo
 * Description  : Delete Local Keys.
 * Arguments    : none
 * Return Value : none
 **********************************************************************************************************************/
void R_BLE_SECD_DelLocInfo(void)
{
    uint8_t invalid_data[BLE_SECD_LOC_AREA_SIZE];

    memset(invalid_data, 0xFF, BLE_SECD_LOC_AREA_SIZE);
    r_dflash_write(BLE_SECD_ADDR_LOC_IRK, invalid_data, BLE_SECD_LOC_AREA_SIZE);

    return;
} /* End of function R_BLE_SECD_DelLocInfo() */


/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_RecvRemKeys
 * Description  : Receive remote keys for write in DataFlash.
 * Arguments    : st_ble_dev_addr_t * p_addr                  ; Remote device address
 *              : st_ble_gap_key_ex_param_t * p_keys          ; Keys from remote device
 * Return Value : none
 **********************************************************************************************************************/
void R_BLE_SECD_RecvRemKeys(st_ble_dev_addr_t * p_addr, st_ble_gap_key_ex_param_t * p_keys)
{
    if((NULL == p_addr) || (NULL == p_keys))
    {
        return;
    }

    (void)p_addr;

    /* key_ex_parma */
    memcpy((uint8_t *)&gs_key_ex_param, (uint8_t *)p_keys, BLE_SECD_REM_KEY_ATTR_SIZE);

    /* keys */
    memcpy((uint8_t *)&gs_key_dist, (uint8_t *)p_keys->p_keys_info, BLE_SECD_REM_KEYS_SIZE);

    return;
} /* End of function R_BLE_SECD_RecvRemKeys() */

/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_WriteRemKeys
 * Description  : Write Remote Keys in DataFlash.
 * Arguments    : st_ble_dev_addr_t * p_addr                  ; Remote device address
 *              : st_ble_gap_auth_info_t * p_keyinfo          ; Key information
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success 
 *                BLE_ERR_INVALID_PTR(0x0001)                 ; p_addr or p_keyinfo is specified as NULL. 
 *                BLE_ERR_INVALID_OPERATION(0x0009)           ; Write to DataFlash is failed.
 *                BLE_ERR_MEM_ALLOC_FAILED(0x000C)            ; Memory allocation is failed.
 **********************************************************************************************************************/
ble_status_t R_BLE_SECD_WriteRemKeys(st_ble_dev_addr_t * p_addr, st_ble_gap_auth_info_t * p_keyinfo)
{
    ble_status_t retval = BLE_SUCCESS;
    int32_t entry;
    int32_t op_code = BLE_SECD_UPD_BN_ADD;
    uint32_t start_addr;
    uint8_t bond_num;
    uint8_t * p_sec_data;

    if((NULL == p_addr) || (NULL == p_keyinfo))
    {
        return BLE_ERR_INVALID_PTR;
    }

