renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/sec_data/r_ble_sec_data.c
    /* mem alloc */
    p_sec_data = malloc(BLE_SECD_MAX_SIZE);
    if(NULL == p_sec_data)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }

    /* read rem area */
    retval = r_dflash_read(BLE_SECD_BASE_ADDR, p_sec_data, BLE_SECD_MAX_SIZE);
    if(BLE_SUCCESS != retval)
    {
        free(p_sec_data);
        return BLE_ERR_INVALID_OPERATION;
    }

    /* find entry with p_addr */
    retval = find_entry(p_addr, &entry, p_sec_data);
    if(BLE_SUCCESS != retval)
    {
        /* find empty entry */
        retval = find_entry(NULL, &entry, p_sec_data);
        if(BLE_SUCCESS != retval)
        {
            /* find oldest entry */
            find_oldest_entry(&entry, p_sec_data);

            /** found the entry for overwrite */
            op_code = BLE_SECD_UPD_BN_ADD_OVERWR;
        }
    }
    else
    {
        /** found the entry for update */
        op_code = BLE_SECD_UPD_BN_UPD;
    }

    start_addr = BLE_SECD_ADDR_REM_START + entry * BLE_SECD_REM_BOND_SIZE;

    /* addr */
    memcpy(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE], 
           (uint8_t *)p_addr, BLE_SECD_BD_ADDR_SIZE);

    /* ex_key_param */
    gs_key_ex_param.p_keys_info = (st_ble_gap_key_dist_t *)(start_addr + BLE_SECD_SEC_KEYS_OFFSET);
    memcpy(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE + BLE_SECD_SEC_KEYS_INFO_OFFSET], 
           (uint8_t *)&gs_key_ex_param, BLE_SECD_REM_KEY_ATTR_SIZE);

    /* keys */
    memcpy(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE + BLE_SECD_SEC_KEYS_OFFSET], 
           (uint8_t *)&gs_key_dist, BLE_SECD_REM_KEYS_SIZE);

    /* keyinfo */
    memcpy(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE + BLE_SECD_SEC_INFO_OFFSET], 
           (uint8_t *)p_keyinfo, BLE_SECD_REM_KEYS_INFO_SIZE);

    /** update bond order and the number of bonds. */
    update_bond_num(entry, op_code, &bond_num, p_sec_data);

    p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE + BLE_SECD_BD_ADDR_SIZE] = bond_num;

    /* write to DataFlash */
    retval = r_dflash_write(BLE_SECD_BASE_ADDR, (uint8_t *)p_sec_data, BLE_SECD_MAX_SIZE);
    free(p_sec_data);
    
    return retval;
} /* End of function R_BLE_SECD_WriteRemKeys() */


/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_Init
 * Description  : Set bonding information in DataFlash to Host Stack.
 * Arguments    : none
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success 
 *                BLE_ERR_INVALID_PTR(0x0001)                 ; p_addr or p_keys is specified as NULL. 
 *                BLE_ERR_INVALID_ARG(0x0003)                 ; Number of bonding information is out of range.
 **********************************************************************************************************************/
ble_status_t R_BLE_SECD_Init(void)
{
    uint8_t in_bond_num;
    uint8_t out_bond_num;
    ble_status_t retval = BLE_SUCCESS;
    uint8_t * p_sec_data;
    st_ble_gap_bond_info_t bond_info[BLE_CFG_NUM_BOND];

    /** Read bonding information from DataFlash. */
    retval = read_bond_info(&in_bond_num, &p_sec_data, bond_info);
    if((BLE_SUCCESS != retval) && (BLE_ERR_NOT_FOUND != retval))
    {
        return retval;
    }

    /** No bonding information is written in DataFlash. */
    if(0 == in_bond_num)
    {
        return BLE_SUCCESS;
    }

    /** Set bonding information in DataFlash to Host Stack. */
    retval = R_BLE_GAP_SetBondInfo(bond_info, in_bond_num, &out_bond_num);

    /** bonding info buffer release */
    release_bond_info_buf(p_sec_data);

    return retval;
} /* End of function R_BLE_SECD_Init() */

/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_GetIdInfo
 * Description  : Get Identify address, IRK from Data Flash.
 * Arguments    : st_ble_dev_addr_t * p_idaddr                ; An array of the addresses to set the identity addresses 
 *                                                            ; stored in Data Flash.
 *              : st_ble_gap_rslv_list_key_set_t * p_key_set  ; An array of the keys to set the IRKs stored 
 *                                                            ; in Data Flash.
 *              : uint8_t * p_num                             ; The number of identity addresses stored in Data Flash.
 **********************************************************************************************************************/
ble_status_t R_BLE_SECD_GetIdInfo(st_ble_dev_addr_t * p_idaddr, 
                                  st_ble_gap_rslv_list_key_set_t * p_key_set, 
                                  uint8_t * p_num)
{
    uint8_t in_bond_num;
    ble_status_t retval = BLE_SUCCESS;
    uint8_t * p_sec_data;
    st_ble_gap_bond_info_t bond_info[BLE_CFG_NUM_BOND];
    st_ble_gap_key_dist_t * key_info;
    uint32_t i;

    if((NULL == p_idaddr) || (NULL == p_key_set) || (NULL == p_num))
    {
        return BLE_ERR_INVALID_PTR;
    }

    /** Read bonding information from DataFlash. */
    retval = read_bond_info(&in_bond_num, &p_sec_data, bond_info);
    if((BLE_SUCCESS != retval) && (BLE_ERR_NOT_FOUND != retval))
    {
        return retval;
    }

    *p_num = 0;

    /** No bonding information is written in DataFlash. */
    if(0 == in_bond_num)
    {
        return BLE_SUCCESS;
    }

    for(i=0; i<in_bond_num; i++)
    {
        key_info = bond_info[i].p_keys->p_keys_info;
        if(0 != (BLE_GAP_KEY_DIST_IDKEY & bond_info[i].p_keys->keys))
        {
            /* set identity address */
            memcpy(p_idaddr[*p_num].addr, &key_info->id_addr_info[1], BLE_BD_ADDR_LEN);
            p_idaddr[*p_num].type = key_info->id_addr_info[0];

