renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/sec_data/r_ble_sec_data.c
            /* set IRK */
            memcpy(p_key_set[*p_num].remote_irk, key_info->id_info, BLE_GAP_IRK_SIZE);
            p_key_set[*p_num].local_irk_type = BLE_GAP_RL_LOC_KEY_REGISTERED;
            (*p_num)++;
        }
    }

    /** bonding info buffer release */
    release_bond_info_buf(p_sec_data);

    return retval;
}

/***********************************************************************************************************************
 * Function Name: R_BLE_SECD_DelRemKeys
 * Description  : Delete Remote Keys.
 * Arguments    : st_ble_dev_addr_t * p_dev_addr              ; Remote device address. IF p_addr is specified as NULL, 
 *                                                            ; all remote keys are deleted.
 **********************************************************************************************************************/
void R_BLE_SECD_DelRemKeys(st_ble_dev_addr_t * p_dev_addr)
{
    uint8_t * p_sec_data;
    ble_status_t retval;

    p_sec_data = malloc(BLE_SECD_MAX_SIZE);
    retval = r_dflash_read(BLE_SECD_BASE_ADDR, p_sec_data, BLE_SECD_MAX_SIZE);
    if(BLE_SUCCESS != retval)
    {
        free(p_sec_data);
        return;
    }

    if(NULL != p_dev_addr)
    {
        int32_t entry;
        int32_t del_target;
        uint8_t bond_num;

        retval = find_entry(p_dev_addr, &entry, p_sec_data);
        if(BLE_SUCCESS == retval)
        {
            update_bond_num(entry, BLE_SECD_UPD_BN_DEL, NULL, p_sec_data);
            bond_num = p_sec_data[BLE_SECD_MGC_NUM_SIZE];
            if((0xFF == bond_num) || (entry == bond_num))
            {
                del_target = entry;
            }
            else
            {
                /* swap remote bond area */
                memcpy(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE], 
                       &p_sec_data[BLE_SECD_SEC_REM_OFFSET + bond_num * BLE_SECD_REM_BOND_SIZE], 
                       BLE_SECD_REM_BOND_SIZE);
                del_target = (int32_t)bond_num;
            }

            memset(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + del_target * BLE_SECD_REM_BOND_SIZE], 0xFF, 
                   BLE_SECD_REM_BOND_SIZE);
        }
    }
    else
    {
        memset(&p_sec_data[BLE_SECD_SEC_REM_OFFSET], 0xFF, BLE_SECD_REM_BOND_SIZE * BLE_CFG_NUM_BOND);
        update_bond_num(0, BLE_SECD_UPD_BN_ALL_DEL, NULL, p_sec_data);
    }

    r_dflash_write((uint32_t)BLE_SECD_BASE_ADDR, p_sec_data, BLE_SECD_MAX_SIZE);
    free(p_sec_data);

    return;
} /* End of function R_BLE_SECD_DelRemKeys() */


/************************************************
 *   static function definitions                *
 ***********************************************/
/***********************************************************************************************************************
 * Function Name: find_entry
 * Description  : Find entry.
 * Arguments    : st_ble_dev_addr_t * p_dev_addr              ; Remote device address
 *              : int32_t * p_entry                           ; Entry
 *              : uint8_t * p_sec_data                        ; Security Data Area
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success 
 *                BLE_ERR_NOT_FOUND(0x000D)                   ; Empty entry is not found.
  *********************************************************************************************************************/
static ble_status_t find_entry(st_ble_dev_addr_t * p_dev_addr, int32_t * p_entry, uint8_t * p_sec_data)
{
    st_ble_dev_addr_t * p_addr;
    int32_t i;
    uint32_t mgc_num = BLE_SECD_MGC_NUM;

    /* check magic number */
    if((NULL != p_dev_addr) && (0 != memcmp(p_sec_data, (uint8_t *)&mgc_num, BLE_SECD_MGC_NUM_SIZE)))
    {
        return BLE_ERR_NOT_FOUND;
    }

    p_addr = (NULL == p_dev_addr) ? (st_ble_dev_addr_t *)&invalid_rem_addr : p_dev_addr;

    for(i=0; i<BLE_CFG_NUM_BOND; i++)
    {
        if((0 == memcmp(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE], 
                        p_addr, BLE_SECD_BD_ADDR_SIZE)) ||
           ((0 == memcmp(&p_sec_data[BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE + 
                          1 + BLE_SECD_SEC_IDADDR_OFFSET], p_addr->addr, BLE_BD_ADDR_LEN)) && 
            (p_addr->type == p_sec_data[BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE + 
                                        BLE_SECD_SEC_IDADDR_OFFSET])))
        {
            *p_entry = i;
            return BLE_SUCCESS;
        }
    }

    return BLE_ERR_NOT_FOUND;
} /* End of function find_entry() */

/***********************************************************************************************************************
 * Function Name: find_oldest_entry
 * Description  : Find the oldest entry.
 * Arguments    : int32_t * p_entry                           ; Entry
 * Return Value : none
  *********************************************************************************************************************/
static void find_oldest_entry(int32_t * p_entry, uint8_t * p_sec_data)
{
    int32_t out_bond;
    int32_t i;
    uint8_t tmp_order;

    out_bond = 0xFF;
    tmp_order = BLE_CFG_NUM_BOND + 1;

    for(i=0; i<BLE_CFG_NUM_BOND; i++)
    {
        uint8_t order;
        order = p_sec_data[BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE + BLE_SECD_BD_ADDR_SIZE];
        if(BLE_CFG_NUM_BOND < order)
        {
            continue;
        }

        if(order < tmp_order)
        {
            tmp_order = order;
            out_bond = i;
        }
    }

    * p_entry = out_bond;

    return;
} /* End of function find_oldest_entry() */

/***********************************************************************************************************************
 * Function Name: update_bond_num
 * Description  : Update Bond Number
 * Arguments    : int32_t entry                               ; Entry
 *              : int32_t op_code                             ; Update Operation Code
 *              : uint8_t * p_alloc_bond_num                  ; Bonding Number
 *              : uint8_t * p_sec_data                        ; Security Data Area
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success 
 *                BLE_ERR_INVALID_OPERATION(0x0009)           ; Magic Numver read or write failure.
  *********************************************************************************************************************/
static ble_status_t update_bond_num(int32_t entry, int32_t op_code, uint8_t * p_alloc_bond_num, uint8_t * p_sec_data)
{
    ble_status_t retval = BLE_ERR_INVALID_OPERATION;
    uint8_t bond_num;
    uint8_t bond_order;

    bond_num = p_sec_data[BLE_SECD_MGC_NUM_SIZE];

