renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/sec_data/r_ble_sec_data.c
    switch(op_code)
    {
        case BLE_SECD_UPD_BN_ADD :
        case BLE_SECD_UPD_BN_ADD_OVERWR :
        case BLE_SECD_UPD_BN_UPD :
            /* update bond_num */
            if(0xFF == bond_num)
            {
                bond_num = 1;
                p_sec_data[BLE_SECD_OUT_BOND_OFFSET] = 0;
                uint32_t mgc_num = BLE_SECD_MGC_NUM;
                memcpy(p_sec_data, (uint8_t *)&mgc_num, BLE_SECD_MGC_NUM_SIZE);
            }
            else if(BLE_CFG_NUM_BOND <= bond_num)
            {
                bond_num = BLE_CFG_NUM_BOND;
            }
            else
            {
                if(BLE_SECD_UPD_BN_UPD != op_code)
                {
                    bond_num++;
                }
            }

            p_sec_data[BLE_SECD_MGC_NUM_SIZE] = bond_num;

            /* update bond order */
            bond_order = 1;
            if(BLE_SECD_UPD_BN_UPD == op_code)
            {
                bond_order = p_sec_data[BLE_SECD_SEC_REM_OFFSET + entry * BLE_SECD_REM_BOND_SIZE + BLE_SECD_BD_ADDR_SIZE];
            }

            if(BLE_SECD_UPD_BN_ADD != op_code)
            {
                update_bond_order(entry, p_sec_data, bond_order);
            }

            * p_alloc_bond_num = bond_num;
            retval = BLE_SUCCESS;
        break;
        default : /* BLE_SECD_UPD_BN_DEL & BLE_SECD_UPD_BN_ALL_DEL */
            if(BLE_CFG_NUM_BOND >= bond_num)
            {
                /* update bond_num */
                if((BLE_SECD_UPD_BN_ALL_DEL == op_code) || (0 == bond_num - 1))
                {
                    bond_num = 0xFF;
                    p_sec_data[BLE_SECD_OUT_BOND_OFFSET] = 0xFF;
                }
                else
                {
                    bond_num = (uint8_t)(bond_num - 1);
                }
                
                p_sec_data[BLE_SECD_MGC_NUM_SIZE] = bond_num;

                if(0xFF != bond_num)
                {
                    bond_order = p_sec_data[BLE_SECD_SEC_REM_OFFSET + 
                                            entry * BLE_SECD_REM_BOND_SIZE + BLE_SECD_BD_ADDR_SIZE];
                    update_bond_order(entry, p_sec_data, bond_order);
                }

                retval = BLE_SUCCESS;
            }
        break;
    }

    return retval;
} /* End of function update_bond_num() */

/***********************************************************************************************************************
 * Function Name: update_bond_order
 * Description  : Check entry validation
 * Arguments    : int32_t entry                               ; Entry
 *              : uint8_t * p_sec_data                        ; Security Data Area
 *              : uint8_t bond_order                          ; Bonding Information order
 * Return Value : none
  *********************************************************************************************************************/
static void update_bond_order(int32_t entry, uint8_t * p_sec_data, uint8_t bond_order)
{
    ble_status_t retval = BLE_ERR_INVALID_OPERATION;
    int32_t i;

    for(i=0; i<BLE_CFG_NUM_BOND; i++)
    {
        if(entry != i)
        {
            retval = is_valid_entry(i);
            if(BLE_SUCCESS != retval)
            {
                continue;
            }

            uint8_t tmp_order;
            tmp_order = p_sec_data[BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE + BLE_SECD_BD_ADDR_SIZE];

            if(bond_order < tmp_order)
            {
                tmp_order = (uint8_t)(tmp_order - 1);
                p_sec_data[BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE + BLE_SECD_BD_ADDR_SIZE] = tmp_order;
                if(1 == tmp_order)
                {
                    p_sec_data[BLE_SECD_OUT_BOND_OFFSET] = (uint8_t)i;
                }
            }
        }
    }

    return;
} /* End of function update_bond_order() */

/***********************************************************************************************************************
 * Function Name: is_valid_entry
 * Description  : Check entry validation
 * Arguments    : int32_t entry                               ; Entry
 * Return Value : BLE_SUCCESS(0x0000)                         ; Success valid entry.
 *                BLE_ERR_INVALID_OPERATION(0x0009)           ; Read BD_ADDR is failed.
 *                BLE_ERR_NOT_FOUND(0x000D)                   ; invalid entry
  *********************************************************************************************************************/
static ble_status_t is_valid_entry(int32_t entry)
{
    ble_status_t retval;
    uint8_t bd_addr[BLE_SECD_BD_ADDR_SIZE];
    uint8_t invalid_bd_addr[BLE_SECD_BD_ADDR_SIZE];
    uint32_t start_addr;

    start_addr = BLE_SECD_ADDR_REM_START + entry * BLE_SECD_REM_BOND_SIZE;
    retval = r_dflash_read(start_addr, bd_addr, BLE_SECD_BD_ADDR_SIZE);
    if(BLE_SUCCESS != retval)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

    memset(invalid_bd_addr, 0xFF, BLE_SECD_BD_ADDR_SIZE);
    if(0 == memcmp(bd_addr, invalid_bd_addr, BLE_SECD_BD_ADDR_SIZE))
    {
        return BLE_ERR_NOT_FOUND;
    }

    return BLE_SUCCESS;
} /* End of function is_valid_entry() */

/***********************************************************************************************************************
 * Function Name: read_bond_info
 * Description  : Read Remote bonding information in DataFlash.
 * Arguments    : uint8_t * p_out_bond_num               ; The number of remote devices whose keys stored in DataFlash.
 *              : uint8_t ** pp_sec_data                 ; The allocate area which in security data is stored.
 *              : st_ble_gap_bond_info_t * p_bond_info   ; The security data to be set by R_BLE_GAP_SetBondInfo().
 * Return Value : BLE_SUCCESS(0x0000)                    ; Success 
 *                BLE_ERR_MEM_ALLOC_FAILED(0x000C)       ; Memory allocation is failed. 
 *                BLE_ERR_NOT_FOUND(0x000D)              ; No security data is stored in DataFlash.
 **********************************************************************************************************************/
static ble_status_t read_bond_info(uint8_t * p_out_bond_num, uint8_t ** pp_sec_data, 
                                   st_ble_gap_bond_info_t * p_bond_info)
{
    int32_t i;
    uint32_t start_addr;
    uint8_t * p_bonds;
    uint32_t magic_num;

    * pp_sec_data = malloc(BLE_SECD_MAX_SIZE);
    p_bonds = * pp_sec_data;
    if(NULL == p_bonds)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }

    r_dflash_read((uint32_t)BLE_SECD_BASE_ADDR, p_bonds, BLE_SECD_MAX_SIZE);

    /** check magic number and bond number */
    *p_out_bond_num = 0;
    memcpy((uint8_t *)&magic_num, p_bonds, BLE_SECD_MGC_NUM_SIZE);
    if((BLE_SECD_MGC_NUM != magic_num) || (0xFF == p_bonds[BLE_SECD_BOND_NUM_OFFSET]) || 
       (0x00 == p_bonds[BLE_SECD_BOND_NUM_OFFSET]))
    {
        free(p_bonds);
        return BLE_ERR_NOT_FOUND;
    }

    if(BLE_CFG_NUM_BOND < p_bonds[BLE_SECD_BOND_NUM_OFFSET])
    {
        free(p_bonds);
        return BLE_ERR_LIMIT_EXCEEDED;
    }

    uint8_t bond_index;
    for(i=0; i<p_bonds[BLE_SECD_BOND_NUM_OFFSET]; i++)
    {
        /* i : DataFlash index */
        start_addr = BLE_SECD_SEC_REM_OFFSET + i * BLE_SECD_REM_BOND_SIZE;
        bond_index = *(uint8_t *)(p_bonds + start_addr + 7) - 1;
        if(bond_index < BLE_CFG_NUM_BOND)
        {
            p_bond_info[bond_index].p_addr = (st_ble_dev_addr_t *)(p_bonds + start_addr);
            p_bond_info[bond_index].p_auth_info = (st_ble_gap_auth_info_t *)(p_bonds + start_addr + BLE_SECD_SEC_INFO_OFFSET);
            p_bond_info[bond_index].p_keys = (st_ble_gap_key_ex_param_t *)(p_bonds + start_addr + BLE_SECD_SEC_KEYS_INFO_OFFSET);
            p_bond_info[bond_index].p_keys->p_keys_info = (st_ble_gap_key_dist_t *)(p_bonds + start_addr + BLE_SECD_SEC_KEYS_OFFSET);
            (*p_out_bond_num)++;
        }
    }

    return BLE_SUCCESS;
} /* End of function read_bond_info() */

