renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/sec_data/r_ble_sec_data.c
/***********************************************************************************************************************
 * Function Name: release_bond_info_buf
 * Description  : Release bonding information buffer.
 * Arguments    : uint8_t * p_sec_data                    ; Security Data stored in RAM.
 * Return Value : none
 **********************************************************************************************************************/
static void release_bond_info_buf(uint8_t * p_sec_data)
{
    free(p_sec_data);
} /* End of function release_bond_info_buf() */


#else  /* (BLE_CFG_EN_SEC_DATA == 1) && (BLE_CFG_HCI_MODE_EN == 0) */

ble_status_t R_BLE_SECD_WriteLocInfo(st_ble_dev_addr_t * p_lc_id_addr, uint8_t * p_lc_irk, uint8_t * p_lc_csrk)
{
    (void)p_lc_id_addr;
    (void)p_lc_irk;
    (void)p_lc_csrk;
    return BLE_ERR_UNSUPPORTED;
}

ble_status_t R_BLE_SECD_ReadLocInfo(st_ble_dev_addr_t * p_lc_id_addr, uint8_t * p_lc_irk, uint8_t * p_lc_csrk)
{
    (void)p_lc_id_addr;
    (void)p_lc_irk;
    (void)p_lc_csrk;
    return BLE_ERR_UNSUPPORTED;
}

void R_BLE_SECD_DelLocInfo(void)
{
    return;
}

void R_BLE_SECD_RecvRemKeys(st_ble_dev_addr_t * p_addr, 
                            st_ble_gap_key_ex_param_t * p_keys)
{
    (void)p_addr;
    (void)p_keys;
    return;
}

ble_status_t R_BLE_SECD_WriteRemKeys(st_ble_dev_addr_t * p_addr, 
                                     st_ble_gap_auth_info_t * p_keyinfo)
{
    (void)p_addr;
    (void)p_keyinfo;
    return BLE_ERR_UNSUPPORTED;
}

ble_status_t R_BLE_SECD_Init(void)
{
    return BLE_ERR_UNSUPPORTED;
}

ble_status_t R_BLE_SECD_GetIdInfo(st_ble_dev_addr_t * p_idaddr, 
                                  st_ble_gap_rslv_list_key_set_t * p_key_set, 
                                  uint8_t * p_cnt)
{
    (void)p_idaddr;
    (void)p_key_set;
    (void)p_cnt;
    return BLE_ERR_UNSUPPORTED;
}

void R_BLE_SECD_DelRemKeys(st_ble_dev_addr_t * p_addr)
{
    (void)p_addr;
    return;
}

#endif /* (BLE_CFG_EN_SEC_DATA == 1) && (BLE_CFG_HCI_MODE_EN == 0) */

